Thanks @magodo I confirm it's all good 👏
```
PS C:\> terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_marketplace_agreement.kali-linux will be created
  + resource "azurerm_marketplace_agreement" "kali-linux" {
      + id                  = (known after apply)
      + license_text_link   = (known after apply)
      + offer               = "kali-linux"
      + plan                = "kali"
      + privacy_policy_link = (known after apply)
      + publisher           = "kali-linux"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_marketplace_agreement.kali-linux: Creating...

Error: A resource with the ID "/subscriptions/<subscription_id>/providers/Microsoft.MarketplaceOrdering/agreements/kali-linux/offers/kali-linux/plans/kali" already exists - to be managed via Terraform this resource needs to be imported into the State. Please see the resource documentation for "azurerm_marketplace_agreement" for more information.

  on kali.tf line 3, in resource "azurerm_marketplace_agreement" "kali-linux":
   3: resource "azurerm_marketplace_agreement" "kali-linux" {


PS C:\> terraform import azurerm_marketplace_agreement.kali-linux /subscriptions/<subscription_id>/providers/Microsoft.MarketplaceOrdering/agreements/kali-linux/offers/kali-l
inux/plans/kali
azurerm_marketplace_agreement.kali-linux: Importing from ID "/subscriptions/<subscription_id>/providers/Microsoft.MarketplaceOrdering/agreements/kali-linux/offers/kali-linux/plans/kali"...
azurerm_marketplace_agreement.kali-linux: Import prepared!
  Prepared azurerm_marketplace_agreement for import
azurerm_marketplace_agreement.kali-linux: Refreshing state... [id=/subscriptions/<subscription_id>/providers/Microsoft.MarketplaceOrdering/agreements/kali-linux/offers/kali-linux/plans/kali]

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.

PS C:\> terraform apply
azurerm_marketplace_agreement.kali-linux: Refreshing state... [id=/subscriptions/<subscription_id>/providers/Microsoft.MarketplaceOrdering/agreements/kali-linux/offers/kali-linux/plans/kali]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
PS C:\>
```